
[X2Ability_WOTC_APA_SpecialistAbilitySet]

;  -- Localized Strings for Tech. Specialist Abilities --
;  ------------------------------------------------------

strProtocolPackages1Name = "协议包 I"
strProtocolPackages1Desc = "<font color='#CA7200'>技能熟练等级 I</font><br/><Bullet/> 获得基础协议能力：<br/>   - 援助协议<br/>   - 致盲协议<br/>   - 战斗协议<br/><Bullet/> 基础协议将在所有初始充能耗尽后慢慢重新充能。"

strProtocolPackages2Name = "协议包 II"
strProtocolPackages2Desc = "<font color='#CA7200'>技能熟练等级 II</font><br/><Bullet/> 获得基础协议能力。<br/><Bullet/> 获得失控协议能力。<br/><Bullet/> 获得修复协议能力。<br/><Bullet/>无人机协议的能力不再消耗所有剩余的行动力。"

strProtocolPackages3Name = "协议包 III"
strProtocolPackages3Desc = "<font color='#CA7200'>技能熟练等级 III</font><br/><Bullet/> 获得基础协议能力。<br/><Bullet/> 获得失控协议能力。<br/><Bullet/> 获得修复协议能力。<br/><Bullet/>无人机协议的能力不再消耗所有剩余的行动力。"


strProtocolSquadConcealmentBrokenFlyover = "移除小队隐蔽!"

strAidProtocolDefenseEffectName = "援助协议"
strAidProtocolDefenseEffectDesc = "+防御力"

strNeutralizingAgentsEffectName = "中和剂：免疫力"
strNeutralizingAgentsEffectDesc = "在援助协议产生的烟雾可以提供对酸性，火焰和毒素的免疫。"

[X2Effect_WOTC_APA_Failsafe]
strFailsafeTriggeredFlyover = "失败保护：消除了负面影响"

[X2Effect_WOTC_APA_DisruptionField]
strDisruptionFieldFlyover = "干扰场：必定未命中!"

[X2Effect_WOTC_APA_RemoteRepair]
strRepairedMessage="+<HealMod/> 点维修效果"

[X2Effect_WOTC_APA_ApplyAidProtocolSmokeToWorld]
strEffectName="援助协议: 防御烟雾"
strEffectDesc="当处于烟雾中时，该单位将对燃烧和酸性伤害免疫。"

[X2Effect_WOTC_APA_ApplyNeutralizingAgentsSmokeToWorld]
strEffectName="中和剂：免疫损伤"
strEffectDesc="当处于烟雾中时，该单位将对燃烧和酸性伤害免疫。"

[X2Effect_WOTC_APA_AdvancedArmorRepair]
strAdvancedArmorRepairMsg="护甲修复: +<HealMod/> 护甲修复效果"

[X2Effect_WOTC_APA_ReduceActionsAfterHack]
strReduceActionsAfterHackFlyover = "电子战:  行动受限!"

[X2Effect_WOTC_APA_ExtendedShutdownTurns]
strExtendedShutdownTurnsFlyover = "电子战:  延长关机!"

[X2Effect_WOTC_APA_SetProtocolRechargeCooldown]
strProtocolRechargeFlyover = "...协议充能中"
